[
  {
    "name" : "John",
    "date" : "02/05/2022",
    "profile" : "https://i.ibb.co/nsxYG1M/profile1.jpg",
    "reviews" : "Ordered combination brake rotors and pads, got the rotors late and the wrong ones. Never did get the pads. Now I am dealing with the return, without much success. I e-mailed them as they requested, returned e-mail and said they would get back to me in 48 hours, that was 5 days ago. Still have no results. I think i'm screwed and out $123.00 with rotors that I have no use for. Do not do business with this company."
  },
  {
    "name" : " Luna",
    "date" : "15/04/2022",
    "profile" : "https://i.ibb.co/qNrbbJZ/profile4.jpg",
    "reviews" : "Their is no way to get ahold of someone in customer service. Leave your number to call you back. Never calls back. Wait on hold for 45 mins to have them hang up on me. Not recommended if their is a problem with parts. When the part has to be returned it cost more to return then the price of the part. No help with return shipping. I am now a former customer of carparts.com"
  },
  {
    "name" : " Steven",
    "date" : "20/05/2022",
    "profile" : "https://i.ibb.co/34h3VB6/profile3.jpg",
    "reviews" : "Been seeking a white passenger side fender for my car for more than 5 weeks now. All companies listed within 65 miles of my zip that list the part on this site in the requested color do NOT have the part in stock Once you call them they will try selling you the part in another color if they have any whatsoever."
  },
  {
    "name" : "Ellie",
    "date" : "24/05/2022",
    "profile" : "https://i.ibb.co/1KJ3rW1/profile5.jpg",
    "reviews" : "Order parts one wasn't in stock they shipped three boxes. One part didn't fit.to contact to get RMA # witch never came i had to chase down the number. They were to send mailing label which never came i had to call to get label. When credit card came there were three charges on bill. I chatted to get a invoice for each that didn't happen. They were mixed together on one invoice still confused and money not right"
  },
  {
    "name" : "Amelia",
    "date" : "17/05/2022",
    "profile" : "https://i.ibb.co/ypnsTtv/profile6.jpg",
    "reviews" : "I ordered a axel for my truck and they sent me the wrong one. So now I cant get ahold of anyone and my truck broke down so I'm out of 200.00 total this is a scam company stay away"
  },
  {
    "name" : "William",
    "date" : "16/05/2022",
    "profile" : "https://i.ibb.co/hKqGsXP/profile2.jpg",
    "reviews" : "If you care about your sanity DO NOT USE this website. I used this website because i was looking for a hood, and now my phone DOESN'T STOP RINGING! Ive had over a dozen phone calls in the last hour from non english speaking mfs asking if im looking for a hood."
  }
]